// 3.29
// 1.登录登出 后台管理 使用Vuex实现 (完成)
// 2.后台管理会员导入功能
// 3.门店权限管理

// 3.30
// 登录路由#号前有个?(已解决)
// vue-resource ---> axios(完成)
// 路由拦截实现权限管理(完成)
// vuex状态管理(完成)
// api提取公共(以开始 ---> 未完成)

// 4.01
// 后台管理(权限增加API调整 剩余 ---> 新增轮播图)
// 列表页(删除功能) ---> 组件优化(蒙层Bug)
// 从4.01以后每天整理 优化问题 设计不合理需求
// 更改'/home'UI
// qs Bug 问题 return Qs.stringify(data,{arrayFormat:'indices'});
// 记录请假 加班状态
// 部分UI黑白 ---> 卡片
// api提取替换 ---> 稳定版本 版本号:56e76bfa7e23f8d4af573eb39cd65fc31b710fd2

// 4.02
// 更改axios catch回调中的处理方法
// 上传商品图片修改后丢失 ---> 用户不操作 不提交数据
// 颜色增多 ---> 修改页面

// 4.05
// 列表页 编辑删除开关 --> 将公有屏蔽(完成)
// 添加商品 ---> 颜色有冗余(完成)


// 微信活动页(待安排任务)
// // 分享公众号
// // 九宫格大转盘
// // 分享后用户多一次抽奖机会
//
// 学习https://github.com/Stevenzwzhai/vue2.0-elementUI-axios-vueRouter(axios的使用)(完成)

// 杂记
// 13684954361

// 后台一些DOTO
// 门店添加私有属性 ---> 添加页面做展示区???